; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	thermograph0 - mode
	thermograph2 - mode
	Star10 - direction
	Star7 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation11 - direction
	Star9 - direction
	Star6 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star6)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation8)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star6)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument6 image1)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 thermograph2)
	(supports instrument8 thermograph0)
	(supports instrument8 image1)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 Star9)
	(calibration_target instrument8 GroundStation11)
	(calibration_target instrument8 Star5)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(pointing satellite3 Phenomenon16)
	(have_image Phenomenon12 thermograph0)
	(have_image Phenomenon13 thermograph0)
	(have_image Phenomenon14 image1)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 thermograph0)
))

)

; plan
1. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 7
2. (calibrate satellite3 instrument6 star5)
   added: (calibrated instrument6)
   goals met: 0 of 7
3. (turn_to satellite3 phenomenon14 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 phenomenon14)
   goals met: 0 of 7
4. (take_image satellite3 phenomenon14 instrument6 image1)
   added: (have_image phenomenon14 image1)
   goals met: 1 of 7
5. (turn_to satellite3 phenomenon13 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon13)
   goals met: 1 of 7
6. (take_image satellite3 phenomenon13 instrument6 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 2 of 7
7. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   goals met: 2 of 7
8. (take_image satellite3 phenomenon12 instrument6 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 3 of 7
9. (turn_to satellite1 groundstation1 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation1)
   goals met: 4 of 7
10. (turn_to satellite3 planet15 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 planet15)
   goals met: 4 of 7
11. (take_image satellite3 planet15 instrument6 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 5 of 7
12. (turn_to satellite3 phenomenon16 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 phenomenon16)
   goals met: 6 of 7
13. (take_image satellite3 phenomenon16 instrument6 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 7 of 7
